In [ ]:
import pandas as pd

data = [10, 20, 30, 40, 50]
num = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=num)
print(series)

data_dict = {'Phy': 79, 'English': 89, 'Chemistry': 90}
series_data = pd.Series(data_dict)
print(series_data)

In [ ]:
import pandas as pd
data = {
    'Name': ['Spiderman', 'IronMan', 'Thor'],
    'Weapon': ['Web shooter', 'NanoTech Suits', 'Hammer'],
    'Strength': [7, 8, 10]
}
index = [1, 2, 3]
df = pd.DataFrame(data, index=index)
print(df)

In [ ]:
import pandas as pd
data = [
    {'Name': 'Vraj', 'Age': '18', 'Role': 'ML engineer'},
    {'Name': 'Peter', 'Age': '20', 'Role': 'Software Manager'},
    {'Name': 'Tony', 'Age': '21', 'Role': 'Data Visualizer'}
]
df = pd.DataFrame(data)
print(df)

In [ ]:
import pandas as pd
df['Salary'] = ['4,50,000', '2,00,000', '70,000']
df.drop('Age', axis=1, inplace=True)

new_row = pd.DataFrame([{
    'Name': 'Rohan',
    'Role': 'Cloud Computing Expert',
    'Salary': '1,75,000'
}])
df = pd.concat([df, new_row], ignore_index=True)
print(df)

In [ ]:
df = pd.read_csv('marvel.csv')
print(df.isnull().any(axis=1))
df.fillna(0, inplace=True)

df.set_index('Character_ID', inplace=True)
df.rename(columns={'Power_Level': "Strength"}, inplace=True)
print(df.head())

In [ ]:
grouped = df.groupby(['Affiliation', 'Name'])['Strength'].sum()
print(grouped)

df['Power'] = df['Strength'].apply(lambda x: x + 101)
grouped_all = df.groupby('Power')['Movies_Appeared'].agg(['mean', 'sum', 'count'])
print(grouped_all)

In [ ]:
import pandas as pd

#Merging and joining Data frames

df1 = pd.DataFrame({
    'Name1':['Rahul','Tony','Steve'],
    'Age':[19,22,21]
})

df2 = pd.DataFrame({
    'Name2':['Rahul','Tony','Salman'],
    'Age':[19,22,45]
})

pd.merge(df1,df2,on="Age",how="inner")

pd.merge(df1,df2,on="Age",how="outer")

   Name1  Age  Name2
0  Rahul   19  Rahul
1   Tony   22   Tony
2  Steve   21    NaN